# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-05 15:14:27 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* BackupClean [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  BackupClean is a small, simple-minded (I hope) Python application to help me
  clean up old archives created with borg.
  I know such a tool exists already, but I was looking for a small project to
  keep me busy. Other people solve crossword puzzles or stuff like that. I
  code.
** Timetable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-03-05 Mi 15:14]
   | Headline                    | Time   |        |      |
   |-----------------------------+--------+--------+------|
   | *Total time*                | *0:23* |        |      |
   |-----------------------------+--------+--------+------|
   | *BackupClean [0/0]*         | *0:23* |        |      |
   | \_  /Components [0/0]/      |        | /0:23/ |      |
   | \_    Talking to Borg [0/0] |        |        | 0:23 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Talking to Borg [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-05 Mi 14:51]--[2025-03-05 Mi 15:14] =>  0:23
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
